settings = {
    'token': 'OTQyNzQxNTczMTE0OTI1MDg5.GNg2F-.Vh9XabqYCFYXEJtUj7qbsZD1chwblIVt3QiZt0',
    'bot': 'MineSkills',
    'id': 942741573114925089,
    'prefix': '.',
    'author': 'CUPcqkeee#1414'
}
commands_bot = {
    'help': 'Команда предназначена для обычных игроков\nИспользуется для ознакомления команд',
    'dev': 'Команда предназначена для обычных игроков\nИспользуется для ознакомления с командой проекта **MineSkills**',
    'menu': 'Команда предназначена для обычных игроков\nИспользуется для вывода быстрого меню с командами',
    'stats': 'Команда предназначена для обычных игроков\nИспользуется для ознакомления со своей статистикой',
    'qa': 'Команда предназначена для обычных игроков\nИспользуется для ознакомления с часто задаваемыми вопросами'
}

faq_bot = {
    '1': '**1) Приобрести проходку на нашем сайте:**\nhttps://mineskills.net/\n\n**2) Присоединится к нашему дискорд серверу:**\nhttps://discord.gg/peseGDVf\n\n**3) Пройти регистрацию на сервере:**\n/register [пароль] [повторение пароля]\n\n**4) Привязать аккаунт Discord к аккаунту Minecraft:**\nНажмите по NPC с названием «ВЫЖИВАНИЕ»',
    '2': 'Прежде чем начинать основное выживание,\nПоговорите с проводником сервера -> **Эллеем**.\n**Он расположен у **входа в каюту корабля**, не бойтесь его!**\n\nПосле разговора с эллеем ознакомьтесь со **всеми NPC**, у которых над головами **есть надпись**\n\nИ теперь отправляйтесь в путь дорогу!\n**Успехов Вам!**',
    '3': 'Новые предметы и механики сервера вы можете посмотреть в специальном канале <#1010904721105637396>,\nЛибо зайти в игру и посмотреть самим!',
    '4': '**Команду проекта** вы можете посмотреть введя ***.команда*** в дискорде,\nПри этом, попасть в неё смогут хорошо запоминающиеся Нам игроки',
    '5': '**Валютой** сервера являются ***доллары***,\nА чтобы их получить, нужно алмазную ***руду*** переработать в верстаке,\nЛибо в инвентаре положив в любое место для крафта',
    '6': '**Валютой** вы можете обмениваться с игроками или \nПотратить на покупку уникальных зачарований\nПродаются они на спавне у торговцев',
    '7': '**Мобо-фермы** запрещены у нас на проекте, если они построены для АФК употребления.\nПодробнее можно прочитать в данном канале <#999336237250904114>',
    '8': '**Использование Стороннего ПО**, такого как Кликеры/X-ray/Другого рода читов - **ЗАПРЕЩЕНО**\nПодробнее можно прочитать в данном канале <#999336237250904114>',
    '9': 'С Администрацией сервера вы можете связаться используя Тикеты в этом канале: <#1011643220914077718>',
    '10': '**Все** доступные вам команды можно узнать написав в чат майнкрафта **"/"** и нажав **TAB**',
    '11': 'Что такое Эра - Ежегодный вайп, то есть обнуление статистики\nЧто такое сезон - Выход небольшого обновления с новыми наградами в МайнПассе <#1048541042011557898>'
}


class colors:
    default = 0
    teal = 0x1abc9c
    dark_teal = 0x11806a
    green = 0x2ecc71
    dark_green = 0x1f8b4c
    blue = 0x3498db
    dark_blue = 0x206694
    purple = 0x9b59b6
    dark_purple = 0x71368a
    magenta = 0xe91e63
    dark_magenta = 0xad1457
    gold = 0xf1c40f
    dark_gold = 0xc27c0e
    orange = 0xe67e22
    dark_orange = 0xa84300
    red = 0xe74c3c
    dark_red = 0x992d22
    lighter_grey = 0x95a5a6
    dark_grey = 0x607d8b
    light_grey = 0x979c9f
    darker_grey = 0x546e7a
    blurple = 0x7289da
    greyple = 0x99aab5
